app/controllers/articles_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "test1213231"], ["description", "Description2234234"], ["created_at", "2019-07-11 08:33:06.128009"], ["updated_at", "2019-07-11 08:33:06.128009"], ["user_id", 1]]
---
    def create
        # render plain: params[:article].inspect
        @article = Article.new(article_params)
        @article.user = User.first
        if @article.save